2020-12-21_17-50-59.035036/merged.yml
---
execution:
- concurrency: ${__P(my_conc,3)}
  hold-for: ${__P(my_hold,10)}
  ramp-up: 50s
  scenario: Thread Group
modules:
  jmeter:
    properties:
      my_conc: 20
      my_hold: 20
reporting:
- criteria:
  - avg-rt>1000ms for 10s, continue as failed
  - avg-lt>2
  - stdev-rt>0.5
  - failures of GET blazedemo >20% for 10s, stop as failed
  - failures of POST purchase flight >20% for 10s, stop as failed
  - failures of GET login page >20% for 10s, stop as failed
  - class: bzt.modules.monitoring.MonitoringCriteria
    condition: '>'
    subject: local/cpu
    threshold: 90
    timeframe: 5s
  module: passfail
- module: console
- dump-csv: test_csv_output.csv
  module: final-stats
  percentiles: true
  summary: true
  summary-labels: true
  test-duration: true
scenarios:
  Thread Group:
    requests:
    - label: GET blazedemo
      method: GET
      url: http://blazedemo.com/
    - body:
        fromPort: Paris
        toPort: Buenos Aires
      label: POST reserve flight
      method: POST
      url: http://blazedemo.com/reserve.php
    - body:
        airline: Virgin America
        flight: 43
        fromPort: Paris
        price: 472.56
        toPort: Buenos Aires
      label: POST purchase flight
      method: POST
      url: http://blazedemo.com/purchase.php
    - body:
        address: 123 Main St.
        cardType: visa
        city: Toronto
        creditCardMonth: 11
        creditCardNumber: 123456781222
        creditCardYear: 2020
        inputName: Ivan Djorgon
        nameOnCard: Ivan Djorgon
        state: Ontario
        zipCode: 12345
      label: POST purchase confirmation
      method: POST
      url: http://blazedemo.com/confirmation.php
    - label: GET login page
      method: GET
      url: http://blazedemo.com/login
    - label: GET vacation page
      method: GET
      url: http://blazedemo.com/vacation.html
    - label: GET index page
      method: GET
      url: http://blazedemo.com/index.php
services:
- module: monitoring
  ~local:
  - interval: 20s
    logging: true
    metrics:
    - cpu
    - disk-space
    - engine-loop